<a href="https://colab.research.google.com/github/AnuBanik/everup-repo/blob/main/Anuradha_3_3_Data_Wrangling_ClassNotes_student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 3-3 Data wrangling with Pandas

In [ ]:
#import pandas and numpy
import pandas as pd
import numpy as np

In [ ]:
#load data
book_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/BL-Flickr-Images-Book.csv')

In [ ]:
#find number of rows and columns
book_df.shape

(8287, 15)

In [ ]:
#summary of statistics by column

book_df.describe()

In [ ]:
#view first few rows
book_df.head()

In [ ]:
#list columns by name
book_df.columns

Data Background Information

After exploring dataset we found that there are 8K+ data points and 12 features. Once I looked at the features I could not find anything significant with below columns. So, I decided to get rid of those columns to trim down the scope of my data analysis work.

In [ ]:
#make a list of columns we no longer want to work with
columns_to_be_dropped = ['Edition Statement','Corporate Author', 'Corporate Contributors', 'Former owner','Engraver']

In [ ]:
#what data type is this
type(columns_to_be_dropped)

In [ ]:
#make a new dataframe without those columns
new_book_df = book_df.drop(columns_to_be_dropped, axis=1)

In [ ]:
new_book_df.head()

I recognized 'Identifier' as an unique key using which any book can be uniquely idetified. So, I chose to make it an index for my new data subset

In [ ]:
new_book_df["Identifier"].is_unique

In [ ]:
#new dataframe with a new index set as Identifier column
book_reindexed_df =  new_book_df.set_index('Identifier')

In [ ]:
book_reindexed_df.head()

In [ ]:
type(book_reindexed_df)

Frame Research Questions

In [ ]:
#year YYYY - 2020, 1979, 1923
#month MM - 09, 12, 03
#day DD  - 11, 22, 31

In [ ]:
#this statement will pull out four digits that are in a row 
regex_val = r'^(\d{4})'

In [ ]:
regex_val

In [ ]:
book_reindexed_df['Date of Publication'].str.isnumeric()

In [ ]:
#viewing some of the rows in question
book_reindexed_df.loc[206]

Place of Publication                                               London
Date of Publication                                           1879 [1878]
Publisher                                                S. Tinsley & Co.
Title                                   Walter Forbes. [A novel.] By A. A
Author                                                              A. A.
Contributors                                              FORBES, Walter.
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks                              British Library HMNTS 12641.b.30.
Name: 206, dtype: object

In [ ]:
book_reindexed_df.loc[4158128]

In [ ]:
book_reindexed_df.loc[4159563]

Now, let's fix the 'date of publication' value

In [ ]:
#extracts values in date of publication column based on our regular expression
book_reindexed_df['Date of Publication'] = book_reindexed_df['Date of Publication'].str.extract(regex_val, expand= False)

In [ ]:
#view our new cleaner column
book_reindexed_df['Date of Publication']

In [ ]:
book_reindexed_df.head()

In [ ]:
#check to see which values are numeric
book_reindexed_df['Date of Publication'].str.isnumeric()

In [ ]:
#change column to numeric
book_reindexed_df['Date of Publication'] = pd.to_numeric(book_reindexed_df['Date of Publication'])

In [ ]:
#check data type
book_reindexed_df['Date of Publication'].dtype

# Property Dataset

In [ ]:
property_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv')

In [ ]:
property_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [ ]:
property_df.shape

In [ ]:
#drops all rows with na values
new_prop_df = property_df.dropna()

In [ ]:
new_prop_df

In [ ]:
new_prop_df.shape

In [ ]:
#check one column for blanks
property_df['NUM_BATH'].isnull()

In [ ]:
#count how many blanks are in that column

property_df['NUM_BATH'].isnull().sum()

In [ ]:
#create a list of all the possibilities for missing values 
missing_values = ['-','--','na','n/a','NA']

In [ ]:
#reload data and transform the missing values to nas
property_na_fix_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv', na_values=missing_values)

In [ ]:
property_na_fix_df

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT PROP_TYPE
0  100001000.0   104.0      PUTNAM  ...        1  1000.0    1000.0
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN   Unknown
2  100003000.0     NaN   LEXINGTON  ...        1   850.0     850.0
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0     700.0
4          NaN   203.0    BERKELEY  ...        2  1600.0    1600.0
5  100006000.0   207.0    BERKELEY  ...        1   800.0     800.0
6  100007000.0     NaN  WASHINGTON  ...   HURLEY   950.0     950.0
7  100008000.0   213.0     TREMONT  ...        1     NaN   Unknown
8  100009000.0   215.0     TREMONT  ...        2  1800.0    1800.0

[9 rows x 8 columns]

In [ ]:
#list the unique values in num_bedrooms column
property_df.NUM_BEDROOMS.unique

In [ ]:
#convert column to numeric datatype, text values will be converted to nan
property_df['NUM_BATH']  = pd.to_numeric(property_df['NUM_BATH'], errors='coerce')

In [ ]:
property_df

In [ ]:
property_na_fix_df['SQ_FT'].dtype

In [ ]:
#create a new column called datatype
#set it equal to BIG if sq_ft is greater than 1000
#set it equal to SMALL if sq_ft is less than 1000
property_na_fix_df['PROP_TYPE'] = np.where((property_na_fix_df['SQ_FT'] > 1000) ,'BIG', 'SMALL')
property_na_fix_df

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT PROP_TYPE
0  100001000.0   104.0      PUTNAM  ...        1  1000.0     SMALL
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN     SMALL
2  100003000.0     NaN   LEXINGTON  ...        1   850.0     SMALL
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0     SMALL
4          NaN   203.0    BERKELEY  ...        2  1600.0       BIG
5  100006000.0   207.0    BERKELEY  ...        1   800.0     SMALL
6  100007000.0     NaN  WASHINGTON  ...   HURLEY   950.0     SMALL
7  100008000.0   213.0     TREMONT  ...        1     NaN     SMALL
8  100009000.0   215.0     TREMONT  ...        2  1800.0       BIG

[9 rows x 8 columns]

In [ ]:
#check our results column
property_na_fix_df['SQ_FT'].isna()

In [ ]:
property_na_fix_df['PROP_TYPE'] = np.where((property_na_fix_df['SQ_FT'].isna() == False) ,property_na_fix_df['SQ_FT'], 'Unknown')
property_na_fix_df

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT PROP_TYPE
0  100001000.0   104.0      PUTNAM  ...        1  1000.0    1000.0
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN   Unknown
2  100003000.0     NaN   LEXINGTON  ...        1   850.0     850.0
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0     700.0
4          NaN   203.0    BERKELEY  ...        2  1600.0    1600.0
5  100006000.0   207.0    BERKELEY  ...        1   800.0     800.0
6  100007000.0     NaN  WASHINGTON  ...   HURLEY   950.0     950.0
7  100008000.0   213.0     TREMONT  ...        1     NaN   Unknown
8  100009000.0   215.0     TREMONT  ...        2  1800.0    1800.0

[9 rows x 8 columns]

# Your turn

* Spend some time with the dataset and practice some data wrangling techniques. 
* Rename all of the columns
* Practice using some of the techniques to handle missing values

In [ ]:
property_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv')
property_df

In [ ]:
property_df.shape

In [ ]:
property_df = property_df.rename(columns={'PID':'Prop_ID', 'ST_NUM': 'St_Num', 'ST_NAME': 'St_Name', 
                                          'OWN_OCCUPIED': 'Own_Occupied', 'NUM_BEDROOMS': 'Bedroom_Num', 
                                          'NUM_BATH': 'Bath_Num', 'SQ_FT': 'Sq_ft'})
property_df